<?php

use Illuminate\Support\Facades\Route;

/*
|--------------------------------------------------------------------------
| Web Routes
|--------------------------------------------------------------------------
|
| Here is where you can register web routes for your application. These
| routes are loaded by the RouteServiceProvider within a group which
| contains the "web" middleware group. Now create something great!
|
*/

use App\Classes\Files;
use App\Models\Product;

Route::get('test', function () {
    $products = [
        0 => array(
            0 => array(
                'title' => 'Коробки для новогодних подарков',
                'image' => '/photo/box1.png',
                'href' => 'buy_box1'
            ),
            1 => array(
                'title' => 'Ящик для хранения',
                'image' => '/photo/box2.png',
                'href' => 'buy_box2'
            ),
            2 => array(
                'title' => 'Коробки для цветов (кашпо)',
                'image' => '/photo/box3.png',
                'href' => 'buy_box3'
            ),
            3 => array(
                'title' => 'Коробки военного типа',
                'image' => '/photo/box4.png',
                'href' => 'buy_box4'
            ),
            4 => array(
                'title' => 'Коробки для фотографий',
                'image' => '/photo/box5.png',
                'href' => 'buy_box5'
            ),
            5 => array(
                'title' => 'Коробки из массива сосны',
                'image' => '/photo/box6.png',
                'href' => 'buy_box6'
            ),
            6 => array(
                'title' => 'Коробки из фанеры',
                'image' => '/photo/box7.png',
                'href' => 'buy_box7'
            ),
            7 => array(
                'title' => 'Коробки для бутылки вина',
                'image' => '/photo/box8.png',
                'href' => 'buy_box8'
            ),
        ),

        '1' => array(
            0 => array(
                'title' => 'Коробка из фанеры "Новый Год" арт: 0011',
                'image' => '/photo/1f65b21b1ef15d265b94c0a33ef6e5dc.jpg',
                'price' => 20,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            1 => array(
                'title' => 'Коробка из фанеры Новый Год арт: 0012',
                'image' => '/photo/2f1fafe8935adaa7590d3e9d03a3016e.jpg',
                'price' => 40,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            2 => array(
                'title' => 'Коробка из фанеры Новый Год арт: 0100',
                'image' => '/photo/0f63a3c92310c08d32ab4c40429f9edc.jpg',
                'price' => 80,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            3 => array(
                'title' => 'Коробка из фанеры Новый Год арт: 0101',
                'image' => '/photo/7d1c45413a9c0865ae4d1e14beeae3c8.jpg',
                'price' => 80,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            4 => array(
                'title' => 'Коробка из фанеры Новый Год арт: 0102',
                'image' => '/photo/360b4f16a4d9c501903021dd83232115.jpg',
                'price' => 90,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            5 => array(
                'title' => 'Коробка из фанеры Новый Год арт: 0103',
                'image' => '/photo/360b4f16a4d9c501903021dd83232115.jpg',
                'price' => 90,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            6 => array(
                'title' => 'Коробка из фанеры Новый год арт: 0104',
                'image' => '/photo/e6ae04ef4875bd4149263e86121d496a.jpg',
                'price' => 50,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            7 => array(
                'title' => 'Коробка из фанеры Новый Год арт: 0105',
                'image' => '/photo/7f0d4055fb2c84355f4117b228bc8143.jpg',
                'price' => 90,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            8 => array(
                'title' => 'Коробка из фанеры Новый Год арт: 0201',
                'image' => '/photo/33980c30edec566af7be4c8591faa47f.jpg',
                'price' => 80,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            9 => array(
                'title' => 'Коробка из фанеры Новый Год арт: 0203',
                'image' => '/photo/f643f90f0543d85e20f43cd44d7db266.jpg',
                'price' => 90,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            10 => array(
                'title' => 'Коробка из фанеры Новый Год арт: 00301',
                'image' => '/photo/d666db26a4fe7d02d344e7e2f9b00d90.jpg',
                'price' => 150,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            11 => array(
                'title' => 'Коробка из фанеры Новый Год арт: 0302',
                'image' => '/photo/2a68b45de48f197e249c5547e642f23d.jpg',
                'price' => 150,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            12 => array(
                'title' => 'Коробка из фанеры Новый Год арт: 0303',
                'image' => '/photo/d666db26a4fe7d02d344e7e2f9b00d90.jpg',
                'price' => 150,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            13 => array(
                'title' => 'Коробка из фанеры Новый Год арт: 0290',
                'image' => '/photo/8f31e1b4af0aae73ecc6ed4a21240cb8.jpg',
                'price' => 90,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            14 => array(
                'title' => 'Коробка из фанеры Новый Год арт: 0107',
                'image' => '/photo/7e84fb182117b622acf9f91dff015b5b.jpg',
                'price' => 90,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            15 => array(
                'title' => 'Коробка из массива Новый Год арт: 0401',
                'image' => '/photo/adb82cc97950d889d4730566f00bf23e.jpg',
                'price' => 150,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            16 => array(
                'title' => 'Коробка из массива Новый Год арт: 0402',
                'image' => '/photo/5351dc93c1d9395561d8812f485329bb.jpg',
                'price' => 150,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            17 => array(
                'title' => 'Коробка из массива Новый Год арт: 0402',
                'image' => '/photo/7473fa89c5fa712aaa30e08bccd9b2fb.jpg',
                'price' => 170,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            18 => array(
                'title' => 'Кормушка-конструктор Год арт: 0502/1',
                'image' => '/photo/2825eebe50d5555e9a6711b14e1c30d4.jpg',
                'price' => 170,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            19 => array(
                'title' => 'Коробка-кормушка арт: 0502',
                'image' => '/photo/8222bb436519a3b091c399c1185ee6d7.jpg',
                'price' => 150,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            20 => array(
                'title' => 'Коробка-кормушка арт: 0501',
                'image' => '/photo/08195c8e51f0603c37ab37483d21a944.jpg',
                'price' => 150,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
        ),

        '2' => array(
            0 => array(
                'title' => 'Коробка из фанеры Книжка арт: 0299',
                'image' => '/photo/bb233a58ba02395308fc607e5e4d4502.jpg',
                'price' => 150,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            1 => array(
                'title' => 'Коробка из фанеры Под алкоголь арт: 0300',
                'image' => '/photo/f442934a7fa31b051644ab941858c216.jpg',
                'price' => 130,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            2 => array(
                'title' => 'Коробка из фанеры Под алкоголь арт: 0301',
                'image' => '/photo/013ac697fb6707057083cc7d284aea99.jpg',
                'price' => 130,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
        ),

        '3' => array(
            0 => array(
                'title' => 'Коробка из фанеры арт: 0311',
                'image' => '/photo/b445a6937404e1abe8af8e7ffe5ea0af.jpg',
                'price' => 90,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            1 => array(
                'title' => 'Коробка из фанеры арт: 0312',
                'image' => '/photo/6f729460d77a9ea5357911dd01ef56ce.jpg',
                'price' => 90,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            2 => array(
                'title' => 'Коробка из фанеры арт: 0313',
                'image' => '/photo/480dd5aa8576288f9e58196838d3fa50.jpg',
                'price' => 90,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            3 => array(
                'title' => 'Военный ящик из массива  арт:арт: 0302',
                'image' => '/photo/1e2946536ad0c1c5dc571132b548d729.jpg',
                'price' => 1000,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            4 => array(
                'title' => 'Военный ящик из массива арт: 0303',
                'image' => '/photo/3b189cc098dc1389c568059e42337129.jpg',
                'price' => 1000,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            5 => array(
                'title' => 'Военный ящик из фанеры арт: 0304',
                'image' => '/photo/90e6e19017017483b00f07221496da1a.jpg',
                'price' => 500,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            6 => array(
                'title' => 'Военный ящик из массива арт: 0305',
                'image' => '/photo/f446d1bd847a8b730358fcc0fe1b3495.jpg',
                'price' => 1000,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            7 => array(
                'title' => 'Военный ящик из массива арт: 0306',
                'image' => '/photo/5b1338d034fdc70b72039978b5b8a165.jpg',
                'price' => 1000,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            8 => array(
                'title' => 'Военный ящик из массива арт: 0307',
                'image' => '/photo/fcfb8e657fb6e70f9ff08bd5c4823c8b.jpg',
                'price' => 1000,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            9 => array(
                'title' => 'Военный ящик из массива арт: 0308',
                'image' => '/photo/f33b678c613711a7226a176e1c9b6681.jpg',
                'price' => 1000,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            10 => array(
                'title' => 'Военный ящик из массива арт: 0309',
                'image' => '/photo/da0c3323858b15f4aa8000858d71628a.jpg',
                'price' => 900,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            11 => array(
                'title' => 'Военный ящик из массива арт: 0310',
                'image' => '/photo/39a9377b1b2fbd148a8b025f3d88d7c4.jpg',
                'price' => 1000,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
        ),

        '4' => array(
            0 => array(
                'title' => 'Коробка из фанеры арт: 7003',
                'image' => '/photo/6269de75e6278a15df86fdcc58c58f9a.jpg',
                'price' => 55,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            1 => array(
                'title' => 'Коробка из фанеры арт: 7005',
                'image' => '/photo/14f7870d2cb878d286e9c4548dc32e52.jpg',
                'price' => 60,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            2 => array(
                'title' => 'Коробка из фанеры арт: 7010',
                'image' => '/photo/2283cd595f48814e5ad1b1a8b7ed3d33.jpg',
                'price' => 125,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            3 => array(
                'title' => 'Коробка из фанеры арт: 7012',
                'image' => '/photo/ea2d4efe620a9346152eae0c1c8204e7.jpg',
                'price' => 135,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            4 => array(
                'title' => 'Коробка из фанеры арт: 7014',
                'image' => '/photo/297724999860e2d6145a226e09c2c7a9.jpg',
                'price' => 125,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            5 => array(
                'title' => 'Коробка из фанеры арт: 7018',
                'image' => '/photo/1c12b5c4718ce4c722d9a09f7722b7ac.jpg',
                'price' => 80,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            6 => array(
                'title' => 'Коробка из фанеры арт: 7025',
                'image' => '/photo/f6aeccf60faa285434b6f5546f2fd78b.jpg',
                'price' => 180,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            7 => array(
                'title' => 'Коробка из фанеры арт: 7028',
                'image' => '/photo/5b1338d034fdc70b72039978b5b8a165.jpg',
                'price' => 140,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            8 => array(
                'title' => 'Коробка из фанеры арт: 7031',
                'image' => '/photo/c009ad8698b77faec609bb28d4f571d7.jpg',
                'price' => 170,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            9 => array(
                'title' => 'Коробка из фанеры арт: 7009',
                'image' => '/photo/426cb23d57031a735d2ca73129a189b6.jpg',
                'price' => 110,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            10 => array(
                'title' => 'Коробка из фанеры арт: 7015',
                'image' => '/photo/86ead8cf3cc3b1b5f7950c81004451cc.jpg',
                'price' => 100,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            11 => array(
                'title' => 'Коробка из фанеры арт: 7024',
                'image' => '/photo/fcbbd1579daa719822fe834bcbe9787d.jpg',
                'price' => 100,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            12 => array(
                'title' => 'Коробка из фанеры арт: 7034',
                'image' => '/photo/c722b561607bcebaf3149a242dc7058b.jpg',
                'price' => 75,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            13 => array(
                'title' => 'Коробка из фанеры арт: 7039',
                'image' => '/photo/9f34d9240b067ef0a28a28ac768c77ac.jpg',
                'price' => 75,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            14 => array(
                'title' => 'Коробка из фанеры арт: 7036',
                'image' => '/photo/990a60cf58813c023d633a76ad6ebeac.jpg',
                'price' => 80,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
        ),

        '5' => array(
            0 => array(
                'title' => 'Деревянный ящик арт: 0340',
                'image' => '/photo/6a7e1229bd96e7306c2c8215384789fd.jpg',
                'price' => 400,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            1 => array(
                'title' => 'Деревянный ящик арт: 0341',
                'image' => '/photo/8baf18e20c2e4e90641a78c73dabc414.jpg',
                'price' => 450,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            2 => array(
                'title' => 'Деревянный ящик арт: 0342',
                'image' => '/photo/bf54028323b686f34c453983811045fa.jpg',
                'price' => 500,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            3 => array(
                'title' => 'Коробка из фанеры арт: 7012',
                'image' => '/photo/bdb59b4a9fd875fa806a81ba163dc220.jpg',
                'price' => 150,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
        ),

        '6' => array(
            0 => array(
                'title' => 'Коробка из фанеры арт: 0311',
                'image' => '/photo/37173210a7973f240efd9a66fa959ca0.jpg',
                'price' => 150,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            1 => array(
                'title' => 'Коробка из фанеры арт: 0312',
                'image' => '/photo/19463d5ccef6a36bf81ce7e0313de567.jpg',
                'price' => 100,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            2 => array(
                'title' => 'Коробка из фанеры арт: 0313',
                'image' => '/photo/bb549e8a3d19745f144b9f9562f041e0.jpg',
                'price' => 100,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            3 => array(
                'title' => 'Коробка из фанеры арт: 0314',
                'image' => '/photo/84547857ff051b8d3fae23a68499ff98.jpg',
                'price' => 150,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            4 => array(
                'title' => 'Коробка из фанеры арт: 0315',
                'image' => '/photo/1e45a06e147b86a94c7cbffdbb7875f2.jpg',
                'price' => 150,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            5 => array(
                'title' => 'Коробка из фанеры арт: 0316',
                'image' => '/photo/23d8102eb15ab72cb6f19ac476fe1e5a.jpg',
                'price' => 150,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
        ),

        '7' => array(
            0 => array(
                'title' => 'Коробка из массива арт: 0317',
                'image' => '/photo/2856ab343a9bfcdad1381969fcf42393.jpg',
                'price' => 140,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            1 => array(
                'title' => 'Коробка из массива арт: 0318',
                'image' => '/photo/613ba9681722f5bc2339d984dc4922c9.jpg',
                'price' => 190,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            2 => array(
                'title' => 'Коробка из массива арт: 0319',
                'image' => '/photo/b10aab1e7cb18f36ef96f65882e7fee8.jpg',
                'price' => 190,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            3 => array(
                'title' => 'Коробка из массива арт: 0320',
                'image' => '/photo/9a0500d6cc39281bc73373d90f1b9fdf.jpg',
                'price' => 250,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            4 => array(
                'title' => 'Коробка из массива арт: 0321',
                'image' => '/photo/e9c117c3a7b746cd1b490557632b0bb8.jpg',
                'price' => 140,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            5 => array(
                'title' => 'Коробка из массива арт: 0322',
                'image' => '/photo/f31832ba3d94f718e104161117c13b03.jpg',
                'price' => 190,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            6 => array(
                'title' => 'Коробка из массива арт: 0323',
                'image' => '/photo/c12541640f10035d4617604138054a84.jpg',
                'price' => 190,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            7 => array(
                'title' => 'Коробка из массива арт: 0324',
                'image' => '/photo/f87488ed447d2692e3294870062296d5.jpg',
                'price' => 190,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
        ),

        '8' => array(
            0 => array(
                'title' => 'Коробка из фанеры арт: 0325',
                'image' => '/photo/cb61441bcf27ef9c615158f116e0ad8e.jpg',
                'price' => 20,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            1 => array(
                'title' => 'Коробка из фанеры арт: 0326',
                'image' => '/photo/47861473ac35febcbef603d0fd0d1fda.jpg',
                'price' => 80,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            2 => array(
                'title' => 'Коробка из фанеры "Стандарт" арт: 0327',
                'image' => '/photo/0f91ed75700e78af71a91b16dc792c0f.jpg',
                'price' => 50,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            3 => array(
                'title' => 'Коробка из фанеры "8 марта" арт: 0328',
                'image' => '/photo/ae7614a14bf21648d2de3d5b3c2aa5a8.jpg',
                'price' => 150,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            4 => array(
                'title' => 'Коробка из фанеры "Стандарт" арт: 0329',
                'image' => '/photo/e5b07d2d524f65108149591c00e0d59b.jpg',
                'price' => 50,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            5 => array(
                'title' => 'Коробка из фанеры "Стандарт" арт: 0330',
                'image' => '/photo/a65d5aea990f03a308629d0c1abc73bd.jpg',
                'price' => 50,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            6 => array(
                'title' => 'Коробка из фанеры "Подарочная" арт: 0331',
                'image' => '/photo/62a084fa5f75ba7abe536e98ad627762.jpg',
                'price' => 190,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            7 => array(
                'title' => 'Коробка из фанеры "Весна" арт: 0332',
                'image' => '/photo/0fbbb29361ff2cf23aa92475f1107938.jpg',
                'price' => 90,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            8 => array(
                'title' => 'Коробка из фанеры арт: 0333',
                'image' => '/photo/de5ba164b14e8c0bd085e9f7f17f7d36.jpg',
                'price' => 120,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            9 => array(
                'title' => 'Коробка из фанеры арт: 0334',
                'image' => '/photo/5dfc3deb305e58f0a4ec43879cc0ccac.jpg',
                'price' => 120,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            10 => array(
                'title' => 'Коробка из фанеры арт: 0335',
                'image' => '/photo/60e5aafd4f9c4d7a3365d2591bbf74a2.jpg',
                'price' => 120,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            11 => array(
                'title' => 'Коробка из фанеры арт: 0336',
                'image' => '/photo/2792cf76e4903c1ceba64dcd2e46bdcf.jpg',
                'price' => 120,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            12 => array(
                'title' => 'Коробка из фанеры арт: 0337',
                'image' => '/photo/07fab416be925cb01c1f8cac68f7f5b6.jpg',
                'price' => 120,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            13 => array(
                'title' => 'Коробка из фанеры арт: 0338',
                'image' => '/photo/e7ea4362165bde901def66609756a5d7.jpg',
                'price' => 120,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
            14 => array(
                'title' => 'Коробка из фанеры арт: 0339',
                'image' => '/photo/fb27458c5e43e9d2553a1b938c7580db.jpg',
                'price' => 190,
                'props' => array(
                    'Размер коробки' => 'индивидуально',
                    'Рисунок коробки' => 'индивидуально',
                    'Тираж' => 'от 20 шт.',
                )
            ),
        )
    ];

    foreach($products as $category_id => $list){
        foreach($list as $data){
            $product = Product::create([
                'category_id' => $category_id,
                'name' => $data['title'],
                'amount' => isset($data['price']) ? $data['price'] : null,
                'props' => isset($data['props']) ? [
                    'name' => array_keys($data['props']),
                    'value' => array_values($data['props']),
                ] : null
            ]);

            if(isset($data['image'])){
                $images = Files::copy(
                    $_SERVER['DOCUMENT_ROOT'] . $data['image'], 
                    'product', 
                    Product::$thumbs
                );

                if($images){
                    $product->update([
                        'images' => [$images]
                    ]);
                }
            }
        }
    }
});

Route::get('/', 'App\Http\Controllers\IndexController@index')->name('home');
Route::get('category/{category}', 'App\Http\Controllers\CategoryController@show')->name('category.show');

Route::group([
    'prefix' => 'admin',
    'namespace' => 'App\Http\Controllers\Admin',
    'middleware' => 'admin',
    'as' => 'admin.'
], function () {
    Route::resource('category', 'CategoryController');
    Route::resource('product', 'ProductController');
    Route::resource('setting', 'SettingController');
});

Route::get('admin', function () {
    return Auth::check() ? redirect()->route('admin.product.index') : redirect()->route('login');
})->name('admin');

Auth::routes();
